In [4]:
import pandas as pd
import numpy as np

In [6]:
a = pd.Series([np.nan,2.5,0.0,3.5,4.5,np.nan],
             ......:index=['f','e','d','c','b','a'])

In [7]:
b = pd.Series([0.,np.nan,2.,np.nan,np.nan,5.],
             ......:index=['a','b','c','d','e','f'])

In [8]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [9]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [10]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [11]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [12]:
df1 = pd.DataFrame({'a':[1.,np.nan,5.,np.nan],
                   ......:'b':[np.nan,2.,np.nan,6.],
                   ......:'c':range(2,18,4)})

In [13]:
df2 = pd.DataFrame({'a':[5.,4.,np.nan,3,7.],
                   ......:'b':[np.nan,3.,4.,6.,8.]})

In [14]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [15]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [17]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [26]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    ......: index=pd.Index(['Toscana', 'Roma'], name='state'),
                    ......: columns=pd.Index(['one', 'two', 'three'],
                    ......: name='number'))

In [27]:
data

number   one  two  three
state
Toscana    0    1      2
Roma       3    4      5

In [28]:
result = data.stack()

In [29]:
result

state    number
Toscana  one       0
         two       1
         three     2
Roma     one       3
         two       4
         three     5
dtype: int64

In [30]:
result.unstack()

number   one  two  three
state
Toscana    0    1      2
Roma       3    4      5

In [31]:
result.unstack(0)

state   Toscana  Roma
number
one           0     3
two           1     4
three         2     5

In [32]:
result.unstack('state')

state   Toscana  Roma
number
one           0     3
two           1     4
three         2     5

In [33]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [34]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [35]:
data2 = pd.concat([s1 ,s2], keys=['one', 'two'])

In [36]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [37]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [38]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [39]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [40]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                 ......:columns=pd.Index(['left', 'right'], name='side'))

In [41]:
df

side            left  right
state   number
Toscana one        0      5
        two        1      6
        three      2      7
Roma    one        3      8
        two        4      9
        three      5     10

In [42]:
df.unstack('state')

side      left        right
state  Toscana Roma Toscana Roma
number
one          0    3       5    8
two          1    4       6    9
three        2    5       7   10

In [43]:
df.unstack('state').stack('side')

state         Toscana  Roma
number side
one    left         0     3
       right        5     8
two    left         1     4
       right        6     9
three  left         2     5
       right        7    10

In [44]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                    ......: 'A': [1, 2, 3],
                    ......: 'B': [4, 5, 6],
                    ......: 'C': [7, 8, 9]})

In [45]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [46]:
melted = pd.melt(df, ['key'])

In [47]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [48]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6